function[gamma]=diploskladotis(l1,l2)
z0=50;
d=0.0075;
%απόσταση μεταξύ κλαδωτών
y0=1/z0;
zl=20-1i*30;
%αντίσταση φορτίου
yl=1/zl;
f0=5*(10^9);
%κεντρική συχνότητα
c=3*(10^8);
f=0:(f0/1000):(2*f0);
b=2*pi*f/c;
y1=zeros(1,2001);
%αγωγιμότητα στην είσοδο του πρώτου κλαδωτή (αθροισμένη με του φορτίου)
for k=1:2001
y1(1,k)=yl+1i*y0*tan(b(1,k)*l1);
end
y2=zeros(1,2001);
%αγωγιμότητα λ/8 πίσω από το προηγούμενο σημείο 1
for k=1:2001
y2(1,k)=y0*(y1(1,k)+1i*y0*tan(b(1,k)*d))/(y0+1i*y1(1,k)*tan(b(1,k)*d));
end
yin=zeros(1,2001);
%αγωγιμότητα εισόδου
for k=1:2001
yin(1,k)=y2(1,k)+1i*y0*tan(b(1,k)*l2);
end
zin=zeros(1,2001);
%αντίσταση εισόδου
for k=1:2001
zin(1,k)=1/yin(1,k);
end
gamma=zeros(1,2001);
%συντελεστής ανάκλασης
for k=1:2001
gamma(1,k)=abs((zin(1,k)-z0)/(zin(1,k)+z0));
end
plot(f,gamma);
end
